frontend/controllers/NewsController.php

SELECT * FROM "news" WHERE "id"='1'
---
    protected function findModel($id)
    {
        if (($model = News::findOne($id)) !== null) {