frontend/models/PasswordResetRequestForm.php

    public function sendEmail()
    {
        /* @var $user User */
        $user = User::findOne([
            'status' => User::STATUS_ACTIVE,
            'email' => $this->email,
        ]);

        if (!$user) {
            return false;
        }

        if (!User::isPasswordResetTokenValid($user->password_reset_token)) {
            $user->generatePasswordResetToken();
            if (!$user->save()) {
---
SELECT * FROM "user" WHERE ("status"=10) AND ("email"='di_KaratuevIN@esrr.rzd')
UPDATE "user" SET "password_reset_token"='Od75KSB9pV7tdz4ApbJulDdWd5fHKhSe_1621990256', "updated_at"=1621990256 WHERE "id"=1