frontend/models/ResendVerificationEmailForm.php

    public function sendEmail()
    {
        $user = User::findOne([
            'email' => $this->email,
            'status' => User::STATUS_INACTIVE
        ]);
---
SELECT * FROM "user" WHERE ("email"='ircuat@gmail.com') AND ("status"=9)