frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
        $user->username = $this->username;
        $user->email = $this->email;
        $user->reinstruction = $this->reinstruction;
        $user->subdivision_id = $this->subdivision_id;
        $user->organization_id = $this->organization_id;
        $user->name = $this->name;
        $user->post_id = $this->post_id;
        $user->description = $this->description;
        $user->phone = $this->phone;
        $user->setPassword($this->password);
        $user->generateAuthKey();
        $user->generateEmailVerificationToken();
        return $user->save() && $this->sendEmail($user);
---
INSERT INTO "user" ("username", "email", "reinstruction", "subdivision_id", "organization_id", "name", "post_id", "description", "phone", "password_hash", "auth_key", "verification_token", "status", "created_at", "updated_at") VALUES ('di_KaratuevIN', 'di_KaratuevIN@esrr.rzd', NULL, NULL, NULL, 'Каратуев Иван Николаевич', NULL, NULL, NULL, '$2y$13$mqdVGTKawukyYzHbN57XOeJgcwOxOgwrc3ag5zmbhjr75UMq8k52e', '6l2HjxNa-M1r6kH-C4iOl4kwS4uwawiT', 'LH3EnbRKbXF7-sACNEKS8kSIsq5YMCR0_1622094207', 9, 1622094207, 1622094207) RETURNING "id"