frontend/views/site/signup.php


                <?= $form->field($model, 'reinstruction')->checkbox() ?>

                <?= $form->field($model, 'organization_id')->dropdownList(ArrayHelper::map(Organization::find()->all(),'id','title')) ?>

                <?= $form->field($model, 'subdivision_id')->dropdownList(ArrayHelper::map(Subdivision::find()->all(),'id','title')) ?>
---
SELECT * FROM "organization"
SELECT * FROM "subdivision"